melee/backwards_waveshine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-20 Sun 21:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Backwards Waveshine OOS</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Backwards Waveshine OOS</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgff8bb81">Waveshine OOS Backwards</a>
<ul>
<li><a href="#orgc901dad">Why is this better</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgff8bb81" class="outline-1">
<h1 id="orgff8bb81">Waveshine OOS Backwards</h1>
<div class="outline-text-1" id="text-orgff8bb81">
<p>
Waveshine OOS is super good. Sometimes they'll hit behind your shield in an attempt to dodge this. Being able to do it backwards makes it much more flexible. Doing it properly backwards is underused, the proper way to do that is to turnaround in the shine, rather than wavedashing backwards like in a normal waveshine.
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/-h4VvMdtA4E?si=Y3G1BsS8drViw84F" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>

<iframe width="560" height="315" src="https://www.youtube.com/embed/tHwVdKb7ffQ?si=f5GhEIgRxtas6A2e&amp;clip=UgkxjZaxhh0csp2u9hmV0p4fpaRByB-y3wzw&amp;clipt=EMmUJxjwvyc" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>

<iframe width="560" height="315" src="https://www.youtube.com/embed/PAOia-60vPo?si=Q5OEm66uSZCXkxNX" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
</div>

<div id="outline-container-orgc901dad" class="outline-2">
<h2 id="orgc901dad">Why is this better</h2>
<div class="outline-text-2" id="text-orgc901dad">
<p>
People do not do the turnaround waveshine forwards because it's 3 frames lower than waveshine backwards, and you have to make sure your jump input doesn't occur during the turnaround frames (otherwise it will get eaten and you'll just stand there).
</p>

<p>
However, waveshine OOS is different from a normal waveshine: you can't jump on the first two frames, since you are airborne and will get doublejump instead of jumpsquat. So, you have to wait anyways. You might as well input the turnaround during these frames. The subsequent jump will only be slower by 1 frame (turnaround takes 3 frames), but you will be facing forwards afterwards. That is, doing a backwards waveshine requires you to burn a frame turning around anyways, so they are equivalent timing-wise.
</p>

<p>
In addition to being equivalent timing-wise, it's much easier to execute from out of shield, since you can input your wavedash angle after hitting the shine oos, and it will turnaround for you. The stick movement for a normal backwards wavedash from shine out of shield is a 3f window (if you input on first frame of jumpsquat, the turnaround takes priority over the jump, so you have until the airdodge frame to input the stick input). In comparison, with the turnaround, you have the entire duration of hitlag to input the wavedash angle, which makes it much much easier (I think turning it to like a 9f window? It's pretty much unmissable with some practice, the shine oos itself is much harder).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
